angle30/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          8100;
        startFace       4325400;
    }
    outlet
    {
        type            patch;
        nFaces          8100;
        startFace       4333500;
    }
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          8100;
        startFace       4341600;
    }
    up
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32400;
        startFace       4349700;
    }
    walls
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          16200;
        startFace       4382100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          24300;
        startFace       4398300;
    }
)

// ************************************************************************* //
