angle30/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}
//laminar
/*
divSchemes
{
    div(phi,alpha)  Gauss interfaceCompression vanLeer 1;

    div(rhoPhi,U)   Gauss linearUpwind grad(U);

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
*/
//turbulento
divSchemes
{
    div(phi,alpha)          Gauss interfaceCompression vanLeer 1;
    div(rhoPhi,U)           Gauss linearUpwind grad(U);
    div(phi,k)              Gauss upwind;                // ← add this
    div(phi,epsilon)        Gauss upwind;                // ← add this
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
